In [1]:
import pandas as pd

1. csv 폴더에서 uriage.csv 로드
2. purchase_date 컬럼의 데이터를 시계열데이터로 변경
3. item_name의 데이터를 모든 문자열을 대문자로 변경
4. item_name의 데이터의 공백을 모두 삭제
5. item_name을 기준으로 오름차순 정렬
6. 인덱스를 초기화
7. 결측치를 채우는 작업
    - item_price 컬럼에 결측치가 존재
    - 상품 A인 경우 결측치는 상품 A의 item_price중 결측치가 아닌 값으로 치환
    - 위의 작업을 상품 A부터 상품 Z까지 반복 작업

In [48]:
uriage = pd.read_csv("../csv/uriage.csv")
uriage.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   object
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
dtypes: float64(1), object(3)
memory usage: 93.8+ KB

In [7]:
uriage.isna().sum()

purchase_date      0
item_name          0
item_price       387
customer_name      0
dtype: int64

In [37]:
# 시계열 데이터로 데이터의 형태를 변경
# pd.to_datetime(변경할 데이터, format = "")

# t = 20230405
# pd.to_datetime(t, format ="%Y%m%d")
# Timestamp('1970-01-01 00:00:00.020230405') : 컴퓨터의 기본적인 시간 단위가 ns라는 의미.

# t = '2023-04-05'
# pd.to_datetime(t)   # pd.to_datetime(t, format ="%Y-%m-%d")

#t = '04-05-23'
#pd.to_datetime(t, format = "%m-%d-%y")

# t = '04/05/23'
# pd.to_datetime(t)

# t = '04/05/05'
# pd.to_datetime(t, format = "%y/%m/%d") : Timestamp('2004-05-05 00:00:00')

Timestamp('2004-05-05 00:00:00')

In [49]:
# purchase_date 컬럼을 시계열로 변경
uriage['purchase_date']
pd.to_datetime(uriage['purchase_date'])

0      2019-06-13 18:02:00
1      2019-07-13 13:05:00
2      2019-05-11 19:42:00
3      2019-02-12 23:40:00
4      2019-04-22 03:09:00
               ...
2994   2019-02-15 02:56:00
2995   2019-06-22 04:03:00
2996   2019-03-29 11:14:00
2997   2019-07-14 12:56:00
2998   2019-07-21 00:31:00
Name: purchase_date, Length: 2999, dtype: datetime64[ns]

In [53]:
# 원본 데이터를 생성
origin_data = uriage.copy()
origin_data

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
1     2019-07-13 13:05     상 품 S         NaN           김우찬
2     2019-05-11 19:42     상 품 a         NaN           김유찬
3     2019-02-12 23:40       상품Z      2600.0           김재현
4      2019-04-22 3:09       상품a         NaN           김강현
...                ...       ...         ...           ...
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2996  2019-03-29 11:14       상품Q         NaN           김지율
2997  2019-07-14 12:56       상품H         NaN           김승주
2998   2019-07-21 0:31       상품D       400.0           정준기

[2999 rows x 4 columns]

In [55]:
# item_name 컬럼의 데이터를 모두 대문자로 변경
# upper() : 믄자열을 모두 대문자 전환
# str.upper() 사용하여 문자열을 대문자로 변경하는 방식
uriage['item_name'] = uriage['item_name'].str.upper()

In [62]:
# apply() 함수를 이용하여 글자를 모두 소문자로 변경
# apply()는 시리즈형태데이터.apply(함수) --> 
# 시리즈의 데이터들을 하나씩 함수안에 넣어서 결과값으로 새로운 시리즈형태의 데이터를 생성

def change(x):
    result = x.lower()
    return result

uriage['item_name'] = uriage['item_name'].apply(change)
uriage['item_name']

0         상품a
1       상 품 s
2       상 품 a
3         상품z
4         상품a
        ...
2994      상품y
2995      상품m
2996      상품q
2997      상품h
2998      상품d
Name: item_name, Length: 2999, dtype: object

In [65]:
# appply(lambda 함수)

uriage['item_name'] = uriage['item_name'].apply(lambda x : x.upper())

# uriage['item_name'] = uriage['item_name'].apply(lambda x : x.lower())와 같은 동작 ->
# def change(x):
#     result = x.lower()
#     return result
# uriage['item_name'] = uriage['item_name'].apply(change)

In [66]:
def change(x):
    print(x)
    return x

uriage.apply(change)

0       2019-06-13 18:02
1       2019-07-13 13:05
2       2019-05-11 19:42
3       2019-02-12 23:40
4        2019-04-22 3:09
              ...
2994     2019-02-15 2:56
2995     2019-06-22 4:03
2996    2019-03-29 11:14
2997    2019-07-14 12:56
2998     2019-07-21 0:31
Name: purchase_date, Length: 2999, dtype: object
0         상품A
1       상 품 S
2       상 품 A
3         상품Z
4         상품A
        ...
2994      상품Y
2995      상품M
2996      상품Q
2997      상품H
2998      상품D
Name: item_name, Length: 2999, dtype: object
0        100.0
1          NaN
2          NaN
3       2600.0
4          NaN
         ...
2994    2500.0
2995    1300.0
2996       NaN
2997       NaN
2998     400.0
Name: item_price, Length: 2999, dtype: float64
0       김가온
1       김우찬
2       김유찬
3       김재현
4       김강현
       ...
2994    김정민
2995    김재원
2996    김지율
2997    김승주
2998    정준기
Name: customer_name, Length: 2999, dtype: object

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
1     2019-07-13 13:05     상 품 S         NaN           김우찬
2     2019-05-11 19:42     상 품 A         NaN           김유찬
3     2019-02-12 23:40       상품Z      2600.0           김재현
4      2019-04-22 3:09       상품A         NaN           김강현
...                ...       ...         ...           ...
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2996  2019-03-29 11:14       상품Q         NaN           김지율
2997  2019-07-14 12:56       상품H         NaN           김승주
2998   2019-07-21 0:31       상품D       400.0           정준기

[2999 rows x 4 columns]

In [78]:
# item_name에 있는 공백을 제거 한다.
# 공백을 제거 하는 함수 : strip() -> 문자열의 좌우 공백을 제거 ->
# 현재 데이터에서는 strip() 사용불가(가운데쪽 공백도 제거해야하므로)
# 문자열 사이의 공백까지 제거하려면 사용할 함수의 이름?
# replace(바꿀 문자열, 대체할 문자열)
# replace(" ", "" )
uriage["item_name"].str.replace(" ", "").str.lower()  # uriage["item_name"].replace(" ", "") 하면 공백아 안 없어짐

0       상품a
1       상품s
2       상품a
3       상품z
4       상품a
       ...
2994    상품y
2995    상품m
2996    상품q
2997    상품h
2998    상품d
Name: item_name, Length: 2999, dtype: object

In [71]:
def change(x):
    result = x.replace(" ", "")
    result = result.lower()
    return result

uriage['item_name'].apply(change)

0       상품a
1       상품s
2       상품a
3       상품z
4       상품a
       ...
2994    상품y
2995    상품m
2996    상품q
2997    상품h
2998    상품d
Name: item_name, Length: 2999, dtype: object

In [81]:
uriage['item_name'] = uriage['item_name'].apply(lambda x : x.replace(" ", "").upper())

In [84]:
# item_name을 기준으로 오름차순 정렬
uriage.sort_values("item_name", inplace=True)

In [86]:
# 인덱스를 초기화 -> 기존의 인덱스는 삭제
uriage.reset_index(drop=True, inplace=True)

In [89]:
uriage['item_price'].isna().value_counts()  #item_price 부분의 결측치 수 확인

False    2612
True      387
Name: item_price, dtype: int64